Revit 2026 API

# FamilyInstanceSpace Property

---

The space in which the instance is located (during the last phase of the project).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Space Space { get; }
```
```vb
Public ReadOnly Property Space As Space
	Get
```
```cpp
public:
property Space^ Space {
	Space^ get ();
}
```
```fsharp
member Space : Space with get
```

#### Property Value

Space

This property will be the first space encountered that contains the instance. If more than one space includes this point in its volume only the first one is returned. If no space is found that contains the instance, or if phase does not apply to this FaimlyInstance, this property is .

#### Reference

FamilyInstance Class

Space Overload

Autodesk.Revit.DB Namespace